#   6. «Выбор следующим самого короткого процесса»
# Обычно интерактивные процессы следуют схеме, при которой ожидается ввод команды, затем она выполняется, ожидается
# ввод следующей команды, затем выполняется эта команда, и т. д. Если выполнение каждой команды рассматривать как
# отдельное «задание», то можно минимизировать общее время отклика, запустив первой выполнение самой короткой команды.
# При реализации необходимо предусмотреть следующие функции:
#      выбор количества заданий в очереди (от 2 до 10);
#      запуск и остановка процесса выполнения;
#      выбор размера кванта времени выполнения;
#      назначение времени выполнения для каждого задания в случайном порядке;
#      расчёт самого короткого времени выполнения исходя из последнего времени выполнения заданий;


#   8. Лотерейное планирование
# Основная идея состоит в раздаче процессам лотерейных билетов на доступ к различным системным ресурсам, в том числе
# и к процессорному времени.
# При реализации необходимо предусмотреть следующие функции:
#      выбор количества заданий в очереди (от 2 до 10);
#      запуск и остановка процесса выполнения;
#      выбор размера кванта времени выполнения;
#      назначение времени выполнения для каждого задания;
#      выбор количества лотерейных билетов для каждого задания;


def main():
    pass
